# Напишите программу, которая считывает файл и выводит количество строк в нем. 
# Для решения задачи нужно использовать for и if.

# Напишите программу, которая считывает файл и выводит количество слов в нем. 
# Для решения задачи нужно использовать for, if и метод строки .split().

# Напишите программу, которая считывает файл и выводит сумму всех чисел, содержащихся в нем. 
# Для решения задачи нужно использовать for, if, try и except.

# Напишите программу, которая считывает файл и выводит на экран только те строки, 
# которые содержат слово "python". 
# Для решения задачи нужно использовать for, if и метод строки .find().

# Напишите программу, которая считывает файл и выводит на экран только те строки, 
# которые начинаются с символа "#". 
# Для решения задачи нужно использовать for, if и метод строки .startswith().

# Напишите программу, которая считывает файл и выводит на экран только те строки, 
# которые заканчиваются символом "!" или "?". 
# Для решения задачи нужно использовать for, if и метод строки .endswith().

# Напишите программу, которая считывает файл и выводит на экран только уникальные строки. 
# Для решения задачи нужно использовать for, if и множества.

# Напишите программу, которая считывает файл и записывает все строки в новый файл в обратном порядке. 
# Для решения задачи нужно использовать for, while и списки.

# Напишите программу, которая считывает файл и заменяет все вхождения слова "python" на "Java". 
# Для решения задачи нужно использовать for, if и метод строки .replace().

# Напишите программу, которая считывает файл и выводит на экран только те строки, 
# которые содержат как минимум два слова. 
# Для решения задачи нужно использовать for, if и метод строки .count().